In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('employees.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [4]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Salary,1000.0,90662.181000,32923.693342,35013.000,62613.00000,90428.0000,118740.250,149908.000
Bonus %,1000.0,10.207555,5.528481,1.015,5.40175,9.8385,14.838,19.944

In [5]:
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance

In [6]:
df['Start Date'] = pd.to_datetime(df['Start Date'])

In [7]:
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,11:17 AM,130590,11.858,False,Finance

In [8]:
df['Last Login Time'] = pd.to_datetime(df['Last Login Time'])

In [9]:
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-12-23 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-12-23 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-12-23 11:17:00,130590,11.858,False,Finance

In [10]:
df['Senior Management'].astype('bool')

0       True
1       True
2      False
3       True
4       True
       ...
995    False
996    False
997    False
998    False
999     True
Name: Senior Management, Length: 1000, dtype: bool

In [11]:
df['Senior Management'] = df['Senior Management'].astype('bool')

In [12]:
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-12-23 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-12-23 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-12-23 11:17:00,130590,11.858,False,Finance

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), datetime64[ns](2), float64(1), int64(1), object(3)
memory usage: 55.8+ KB

In [15]:
df['Gender'] = df['Gender'].astype('category')

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 49.0+ KB

In [17]:
df = pd.read_csv('employees.csv', parse_dates = ['Start Date', 'Last Login Time'])
# df['Start Date'] = pd.to_datetime(df['Start Date'])
# df['Last Login Time'] = pd.to_datetime(df['Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category')

In [18]:
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-12-23 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-12-23 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-12-23 11:17:00,130590,11.858,False,Finance

# Filter a Data Frame Based On A Condition

In [19]:
df['Gender']

0        Male
1        Male
2      Female
3        Male
4        Male
        ...
995       NaN
996      Male
997      Male
998      Male
999      Male
Name: Gender, Length: 1000, dtype: category
Categories (2, object): ['Female', 'Male']

In [20]:
df[df.Gender == 'Male']

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-12-23 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-12-23 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2020-12-23 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2020-12-23 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2020-12-23 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
994,George,Male,2013-06-21,2020-12-23 17:47:00,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,2020-12-23 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2020-12-23 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2020-12-23 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2020-12-23 18:24:00,129949,10.169,True,Sales

In [21]:
mask = df['Start Date'] < '1985-01-01'

In [22]:
df[mask]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
10,Louise,Female,1980-08-12,2020-12-23 09:01:00,63241,15.132,True,NaN
12,Brandon,Male,1980-12-01,2020-12-23 01:08:00,112807,17.492,True,Human Resources
18,Diana,Female,1981-10-23,2020-12-23 10:27:00,132940,19.082,False,Client Services
28,Terry,Male,1981-11-27,2020-12-23 18:30:00,124008,13.464,True,Client Services
37,Linda,Female,1981-10-19,2020-12-23 20:49:00,57427,9.557,True,Client Services
...,...,...,...,...,...,...,...,...
982,Rose,Female,1982-04-06,2020-12-23 10:43:00,91411,8.639,True,Human Resources
983,John,Male,1982-12-23,2020-12-23 22:35:00,146907,11.738,False,Engineering
985,Stephen,NaN,1983-07-10,2020-12-23 20:10:00,85668,1.909,False,Legal
986,Donna,Female,1982-11-26,2020-12-23 07:04:00,82871,17.999,False,Marketing
996,Phillip,Male,1984-01-31,2020-12-23 06:30:00,42392,19.675,False,Finance

In [23]:
df[df.Salary > 110_000]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2020-12-23 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2020-12-23 13:00:00,138705,9.340,True,Finance
5,Dennis,Male,1987-04-18,2020-12-23 01:35:00,115163,10.125,False,Legal
9,Frances,Female,2002-08-08,2020-12-23 06:51:00,139852,7.524,True,Business Development
12,Brandon,Male,1980-12-01,2020-12-23 01:08:00,112807,17.492,True,Human Resources
...,...,...,...,...,...,...,...,...
987,Gloria,Female,2014-12-08,2020-12-23 05:08:00,136709,10.331,True,Finance
991,Rose,Female,2002-08-25,2020-12-23 05:12:00,134505,11.051,True,Marketing
992,Anthony,Male,2011-10-16,2020-12-23 08:35:00,112769,11.625,True,Finance
995,Henry,NaN,2014-11-23,2020-12-23 06:09:00,132483,16.655,False,Distribution
999,Albert,Male,2012-05-15,2020-12-23 18:24:00,129949,10.169,True,Sales

In [25]:
#filtering for true values using bool
df[df['Senior Management']]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-12-23 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-12-23 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2020-12-23 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2020-12-23 16:47:00,101004,1.389,True,Client Services
6,Ruby,Female,1987-08-17,2020-12-23 16:20:00,65476,10.012,True,Product
...,...,...,...,...,...,...,...,...
991,Rose,Female,2002-08-25,2020-12-23 05:12:00,134505,11.051,True,Marketing
992,Anthony,Male,2011-10-16,2020-12-23 08:35:00,112769,11.625,True,Finance
993,Tina,Female,1997-05-15,2020-12-23 15:53:00,56450,19.040,True,Engineering
994,George,Male,2013-06-21,2020-12-23 17:47:00,98874,4.479,True,Marketing
999,Albert,Male,2012-05-15,2020-12-23 18:24:00,129949,10.169,True,Sales

In [26]:
df[df.Team != 'Marketing']

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,2020-12-23 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-12-23 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2020-12-23 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2020-12-23 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2020-12-23 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
995,Henry,NaN,2014-11-23,2020-12-23 06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,2020-12-23 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2020-12-23 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2020-12-23 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2020-12-23 18:24:00,129949,10.169,True,Sales

# Multiple Conditions